set_time_format -unit ns -decimal_places 3
create_clock -name {clk} -period 5.000 -waveform { 0.000 2.500 } [get_ports {clk_ext_in}]
create_clock -name {usb_clk} -period 5.000 -waveform { 0.000 2.500 } [get_ports {clk_usb_in}]
create_clock -name {vclk} -period 5.000
create_generated_clock -source {clk_generator_inst|altpll_component|pll|inclk[0]} -duty_cycle 50.00 -name {processor_clk} {clk_generator_inst|altpll_component|pll|clk[0]}
create_generated_clock -source {clk_generator_inst|altpll_component|pll|inclk[0]} -phase -90.00 -duty_cycle 50.00 -name {write_clk} {clk_generator_inst|altpll_component|pll|clk[1]}
set_false_path -from [get_clocks processor_clk] -to [get_clocks vclk]
set_false_path -from [get_clocks vclk] -to [get_clocks processor_clk]

set_false_path -from [get_ports {n_rst_ext_in}]
set_false_path -from [get_ports {sw_in*}]
set_output_delay            -clock vclk -max 0 [get_ports {seg_*}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {seg_*}]
set_output_delay            -clock vclk -max 0 [get_ports {led*}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {led*}]

set_output_delay            -clock vclk -max 4 [get_ports {mem_a_n_we}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_a_n_we}]
set_output_delay            -clock vclk -max 4 [get_ports {mem_a_n_oe}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_a_n_oe}]
set_output_delay            -clock vclk -max 4 [get_ports {mem_a_n_ce}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_a_n_ce}]
set_output_delay            -clock vclk -max 4 [get_ports {mem_a_n_lb}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_a_n_lb}]
set_output_delay            -clock vclk -max 4 [get_ports {mem_a_n_ub}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_a_n_ub}]

set_output_delay            -clock vclk -max 32 [get_ports {mem_a_addr*}]
set_output_delay -add_delay -clock vclk -min 0  [get_ports {mem_a_addr*}]
set_output_delay            -clock vclk -max 32 [get_ports {mem_a_data*}]
set_output_delay -add_delay -clock vclk -min 0  [get_ports {mem_a_data*}]
set_input_delay             -clock vclk -max 10 [get_ports {mem_a_data*}]
set_input_delay  -add_delay -clock vclk -min 0  [get_ports {mem_a_data*}]

set_output_delay            -clock vclk -max 4 [get_ports {mem_b_n_we}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_b_n_we}]
set_output_delay            -clock vclk -max 4 [get_ports {mem_b_n_oe}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_b_n_oe}]
set_output_delay            -clock vclk -max 4 [get_ports {mem_b_n_ce}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_b_n_ce}]
set_output_delay            -clock vclk -max 4 [get_ports {mem_b_n_lb}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_b_n_lb}]
set_output_delay            -clock vclk -max 4 [get_ports {mem_b_n_ub}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {mem_b_n_ub}]

set_output_delay            -clock vclk -max 32 [get_ports {mem_b_addr*}]
set_output_delay -add_delay -clock vclk -min 0  [get_ports {mem_b_addr*}]
set_output_delay            -clock vclk -max 32 [get_ports {mem_b_data*}]
set_output_delay -add_delay -clock vclk -min 0  [get_ports {mem_b_data*}]
set_input_delay             -clock vclk -max 10 [get_ports {mem_b_data*}]
set_input_delay  -add_delay -clock vclk -min 0  [get_ports {mem_b_data*}]

set_output_delay            -clock vclk -max 18 [get_ports {usb_data*}]
set_output_delay -add_delay -clock vclk -min 0 [get_ports {usb_data*}]
set_input_delay             -clock vclk -max 10 [get_ports {usb_n_cmd}]
set_input_delay  -add_delay -clock vclk -min 0  [get_ports {usb_n_cmd}]
set_input_delay             -clock vclk -max 10 [get_ports {usb_n_frd}]
set_input_delay  -add_delay -clock vclk -min 0  [get_ports {usb_n_frd}]
set_input_delay             -clock vclk -max 10 [get_ports {usb_n_fwr}]
set_input_delay  -add_delay -clock vclk -min 0  [get_ports {usb_n_fwr}]
set_input_delay             -clock vclk -max 10 [get_ports {usb_data*}]
set_input_delay  -add_delay -clock vclk -min 0  [get_ports {usb_data*}]
